import React from 'react';
import Title from "../../ui/Title";
import {Box, Container, Stack} from "@lib/mui";
import {Element} from '@lib/react-scroll'
import AccordionCustom, {IAccordion} from "@components/QuestionAndAnswerBlock/ui/AccordionCustom";

const QuestionAndAnswerBlock = () => {

    const accordions: IAccordion[] = [
        {
            name: 'panel1',
            title: 'Неприятный запах от животного можете удалить?',
            description: 'Да. Нейтрализуем запах с гарантией результата. Если запах вновь проявится, повторная нейтрализация БЕСПЛАТНО.'
        },
        {
            name: 'panel2',
            title: 'Нужно уходить из дома во время чистки?',
            description: 'Нет, процедура полностью безопасна, мы не используем средства с резкими запахами. Можно находиться дома и даже смотреть за работой.'
        },
        {
            name: 'panel3',
            title: 'Неприятный запах от животного можете удалить?',
            description: 'Чистка подразумевает удаление всех загрязнений с обивки, в том числе и шерсть животных.'
        },
        {
            name: 'panel4',
            title: 'У Меня аллергия на моющие средства, могу ли я воспользоваться услугой?',
            description: 'Да, можете. Технология чистки подразумевает полное удаление остатков моющих средств из обивки. Обязательно предупредите мастера про аллергию и он сделает дополнительную промывку чистой водой.'
        },
        {
            name: 'panel5',
            title: 'Когда сможете приехать?',
            description: 'Работаем без выходных, выезжаем в любое удобное время дня и ночи.'
        },
        {
            name: 'panel6',
            title: 'От чего зависит стоимость чистки?',
            description: 'Стоимость зависит от: Размера изделия, Формы спинок и подлокотников, Степени загрязнения/наличия запаха, Материала обивки, Наличия съемных подушек'
        },
        {
            name: 'panel7',
            title: 'С организациями работаете?',
            description: 'Работаем с любыми организациями по договору, через расчетный счет.'
        },
        {
            name: 'panel8',
            title: 'Сколько сохнет после чистки?',
            description: 'Экспресс сушка - 2-3 часа, самостоятельное высыхание 6-10 часов'
        },
        {
            name: 'panel9',
            title: 'Сколько времени занимает чистка?',
            description: 'Среднее время чистки одного изделия 2-4 часа'
        },
        {
            name: 'panel10',
            title: 'В область выезжаете?',
            description: 'Да, выезжаем. В ближайшие города области выезд бесплатный, выезд в отдаленные областные города и районы обговаривается индивидуально.'
        },
        {
            name: 'panel11',
            title: 'Процедура безопасна для детей и животных?',
            description: 'Технология полностью безопасна для детей и животных. Процедура проходит без резких неприятных запахов, можно находиться дома и наблюдать за процессом.'
        },
        {
            name: 'panel12',
            title: 'Какие способы оплаты?',
            description: 'Наличные, перевод на карту, оплата на расчетный счет.'
        }
    ]

    return (
        <section>
            <Container sx={{padding: '50px 0'}}>
                <Stack spacing={5}>
                    <Element name='voprosy'>
                        <Title color='secondary' textMain='вопросы' textSecondary='и ответы'/>
                    </Element>
                    <Box>
                        <AccordionCustom accordions={accordions}/>
                    </Box>
                </Stack>
            </Container>
        </section>
    );
};

export default QuestionAndAnswerBlock;